import { FC } from "react";
import Link from "next/link";

import type { NextPage } from "next";

const PostAboutProject: FC<NextPage> = () => {
  return (
    <div className="posts-container container">
      <div className="post post-wrapper">
        <div className="user-author">
          <div className="author">
            <div className="user-icon"></div>
            <div className="author-names">
              <p>Про проєкт</p>
              <div className="name">
                <Link href={`/`}>Unlib</Link>
              </div>
            </div>
          </div>
        </div>
        <div className="content">
          <div className="title">
            <h3>Ласкаво просимо на {"Unilib"} - перший український форум!</h3>
          </div>
          <div className="text-block">
            <p>
              {"Unilib"} - це унікальний інтернет-проект, створений для
              зближення людей з усіх куточків України та навіть за її межами.
              Наша мета - створити онлайн спільноту, де кожен користувач може
              ділитись своїми інтересами, думками, знаннями та досвідом з іншими
              українцями.
            </p>
            Вода - це символ єднання, і вона є невід{"'"}ємною частиною нашого
            опису проекту. Ми розуміємо, що вода сполучає нас як націю, вона
            текуча, мінлива та завжди у русі, так само, як і ідеї та обмін
            знаннями на
            {"Unilib"}. Ми хочемо, щоб наш форум був місцем, де ідеї та думки
            також текучі, мінливі та постійно розвиваються.
            <p>
              Основні цінності {"Unilib"} - це взаємоповага, толерантність та
              різноманіття. Ми відкриті для усіх тем та обговорень, які сприяють
              збагаченню нашої спільноти та сприяють нашому взаємному розвитку.
              Чи це актуальні новини, культурні події, наукові дослідження або
              просто теми, які збуджують наш інтелектуальний апетит - {"Unilib"}{" "}
              - місце, де ви можете знайти розуміння, підтримку та нових друзів.
            </p>
            <p>
              У нашому форумі є розділи для будь-яких інтересів, починаючи від
              освіти та науки до спорту, мистецтва та розваг. Заохочуємо наших
              користувачів активно долучатись до обговорень, ділитись
              пізнавальними посиланнями, розповідати про свої власні досягнення
              та переживання.
            </p>
            <p>
              На {"Unilib"} ми прагнемо створити водну спільноту, яка буде
              джерелом інсайтів, натхнення та пізнання. Тут кожен може знайти
              своє місце, бо, так само як вода у річці, наш форум рухається
              вперед, відкриваючи нові можливості для нашого розуміння світу.
            </p>
            <p>
              Приєднуйтесь до {"Unilib"} і станьте частиною цієї унікальної
              спільноти! Ми віримо, що разом ми зможемо змінити світ на краще,
              одна думка за одну думку, так само, як кожна краплинка води
              збільшує велику ріку!
            </p>
          </div>
        </div>
        <div className="add-info">
          <div className="lt-side"></div>
          <div className="rt-side"></div>
        </div>
        <div className="interactions">
          <div className="lt-side"></div>
          <div className="rt-side"></div>
        </div>
      </div>
    </div>
  );
};

export default PostAboutProject;
