import { FC } from "react";
import Link from "next/link";

import type { NextPage } from "next";

const PostRulesProject: FC<NextPage> = () => {
  return (
    <div className="posts-container container">
      <div className="post post-wrapper">
        <div className="user-author">
          <div className="author">
            <div className="user-icon"></div>
            <div className="author-names">
              <p>Про правила проєкту</p>
              <div className="name">
                <Link href={`/`}>Unlib</Link>
              </div>
            </div>
          </div>
        </div>
        <div className="content">
          <div className="title">
            <h3>Правила форуму {"Unilib"}</h3>
          </div>
          <div className="text-block">
            <ol>
              <li>
                Ввічливість та повага: Будь ласка, ставтеся до інших учасників з
                повагою та взаємоповажанням. Уникайте образливих висловлювань та
                ведіть дискусії конструктивно.
              </li>
              <li>
                Тематика: Розміщуйте свої повідомлення у відповідних розділах
                форуму. Перед початком нової теми переконайтеся, що вона
                відповідає тематиці розділу.
              </li>
              <li>
                Заборонені матеріали: Заборонено публікувати або посилатись на
                матеріали, що порушують законодавство України або міжнародні
                стандарти авторських прав.
              </li>
              <li>
                Спам та реклама: Заборонено розміщувати небажану рекламу або
                надсилати непохдні пропозиції. Спам та реклама будуть видалені,
                а автори можуть бути забанені.
              </li>
              <li>
                Оформлення повідомлень: Спростуйте оформлення текстів для
                зручності читання. Використовуйте абзаци, заголовки, списки,
                теги цитування тощо.
              </li>
              <li>
                Авторські права: Перед поширенням контенту, переконайтеся, що у
                вас є відповідні права або отримайте дозвіл від автора.
              </li>
              <li>
                Мова форуму: Офіційна мова форуму - українська. Прохання
                використовувати українську мову для спілкування.
              </li>
              <li>
                Адміністратори та модератори: Слідкуйте за вказівками
                адміністраторів та модераторів форуму. Вони допоможуть зберегти
                порядок і добру атмосферу на форумі.
              </li>
              <li>
                Приватні дані: Уникайте публікації особистих або конфіденційних
                даних, які можуть порушити приватність інших користувачів.
              </li>
              <li>
                Використання інформації: Ви можете цитувати інформацію з інших
                джерел, але необхідно надавати посилання на джерело.
              </li>
            </ol>
            <p>
              Невиконання правил може призвести до попередження, блокування
              акаунту або інших заходів у відповідності зі ступенем порушення.
            </p>
            <p>
              Бажаємо вам приємного та корисного часу на форумі {"Unilib"}!
              Долучайтеся до обговорень, діліться знаннями та знаходьте нових
              друзів у нашій спільноті!
            </p>
          </div>
        </div>
        <div className="add-info">
          <div className="lt-side"></div>
          <div className="rt-side"></div>
        </div>
        <div className="interactions">
          <div className="lt-side"></div>
          <div className="rt-side"></div>
        </div>
      </div>
    </div>
  );
};

export default PostRulesProject;
