import Image from "next/image";
import { Content, AuthorInfo, Post } from "../components";

import postImage from "../public/images/image-post.png";

const Category = ({}) => {
  const postsArray = [
    {
      group: "Научпоп",
      name: "Кирило Туров",
      time: "12:31",
      title: "Шлях новачка у мікробіології: купив мікроскоп",
      likesCount: 256,
      commentsCount: 256,
      viewsCount: 1340,
      tags: ["#Наука", "#2023"],
      content: [
        <>
          <p>
            Всім привіт. На свій день народження нарешті дозволив собі купити
            мікроскоп. Простий, аматорський – Мікромед Р-1. Допомогли друзі,
            дружина, робота. Але ось невдача, зовсім забув взяти предметні та
            покривні шибки. Так що якість фотографій поки що середня - покривне
            скло придбала, а ось предметні поки не дійшли (у місті не
            продаються). Всі препарати готував сам, вибачте за якість, згодом
            буде краще.
          </p>
          <div className="image-holder container">
            <Image src={postImage} alt="post-image-holder" />
          </div>
          <p>
            Цибуля класична. 640x(правда пізніше я дізнався, що його краще
            замочити ненадовго в йоді - тоді і клітини та ядра буде видно краще.
            Виправлюсь пізніше).
          </p>
        </>,
      ],
    },
    {
      group: "Научпоп",
      name: "Кирило Туров",
      time: "12:31",
      title: "Шлях новачка у мікробіології: купив мікроскоп",
      likesCount: 256,
      commentsCount: 256,
      viewsCount: 1340,
      tags: ["#Наука", "#2023"],
      content: [
        <>
          <p>
            Всім привіт. На свій день народження нарешті дозволив собі купити
            мікроскоп. Простий, аматорський – Мікромед Р-1. Допомогли друзі,
            дружина, робота. Але ось невдача, зовсім забув взяти предметні та
            покривні шибки. Так що якість фотографій поки що середня - покривне
            скло придбала, а ось предметні поки не дійшли (у місті не
            продаються). Всі препарати готував сам, вибачте за якість, згодом
            буде краще.
          </p>
          <div className="image-holder container">
            <Image src={postImage} alt="post-image-holder" />
          </div>
          <p>
            Цибуля класична. 640x(правда пізніше я дізнався, що його краще
            замочити ненадовго в йоді - тоді і клітини та ядра буде видно краще.
            Виправлюсь пізніше).
          </p>
        </>,
      ],
    },
    {
      group: "Научпоп",
      name: "Кирило Туров",
      time: "12:31",
      title: "Шлях новачка у мікробіології: купив мікроскоп",
      likesCount: 256,
      commentsCount: 256,
      viewsCount: 1340,
      tags: ["#Наука", "#2023"],
      content: [
        <>
          <p>
            Всім привіт. На свій день народження нарешті дозволив собі купити
            мікроскоп. Простий, аматорський – Мікромед Р-1. Допомогли друзі,
            дружина, робота. Але ось невдача, зовсім забув взяти предметні та
            покривні шибки. Так що якість фотографій поки що середня - покривне
            скло придбала, а ось предметні поки не дійшли (у місті не
            продаються). Всі препарати готував сам, вибачте за якість, згодом
            буде краще.
          </p>
          <div className="image-holder container">
            <Image src={postImage} alt="post-image-holder" />
          </div>
          <p>
            Цибуля класична. 640x(правда пізніше я дізнався, що його краще
            замочити ненадовго в йоді - тоді і клітини та ядра буде видно краще.
            Виправлюсь пізніше).
          </p>
        </>,
      ],
    },
    {
      group: "Научпоп",
      name: "Кирило Туров",
      time: "12:31",
      title: "Шлях новачка у мікробіології: купив мікроскоп",
      likesCount: 256,
      commentsCount: 256,
      viewsCount: 1340,
      tags: ["#Наука", "#2023"],
      content: [
        <>
          <p>
            Всім привіт. На свій день народження нарешті дозволив собі купити
            мікроскоп. Простий, аматорський – Мікромед Р-1. Допомогли друзі,
            дружина, робота. Але ось невдача, зовсім забув взяти предметні та
            покривні шибки. Так що якість фотографій поки що середня - покривне
            скло придбала, а ось предметні поки не дійшли (у місті не
            продаються). Всі препарати готував сам, вибачте за якість, згодом
            буде краще.
          </p>
          <div className="image-holder container">
            <Image src={postImage} alt="post-image-holder" />
          </div>
          <p>
            Цибуля класична. 640x(правда пізніше я дізнався, що його краще
            замочити ненадовго в йоді - тоді і клітини та ядра буде видно краще.
            Виправлюсь пізніше).
          </p>
        </>,
      ],
    },
    {
      group: "Научпоп",
      name: "Кирило Туров",
      time: "12:31",
      title: "Шлях новачка у мікробіології: купив мікроскоп",
      likesCount: 256,
      commentsCount: 256,
      viewsCount: 1340,
      tags: ["#Наука", "#2023"],
      content: [
        <>
          <p>
            Всім привіт. На свій день народження нарешті дозволив собі купити
            мікроскоп. Простий, аматорський – Мікромед Р-1. Допомогли друзі,
            дружина, робота. Але ось невдача, зовсім забув взяти предметні та
            покривні шибки. Так що якість фотографій поки що середня - покривне
            скло придбала, а ось предметні поки не дійшли (у місті не
            продаються). Всі препарати готував сам, вибачте за якість, згодом
            буде краще.
          </p>
          <div className="image-holder container">
            <Image src={postImage} alt="post-image-holder" />
          </div>
          <p>
            Цибуля класична. 640x(правда пізніше я дізнався, що його краще
            замочити ненадовго в йоді - тоді і клітини та ядра буде видно краще.
            Виправлюсь пізніше).
          </p>
        </>,
      ],
    },
  ];

  return (
    <Content>
      <AuthorInfo />
      <div className="posts-container container">
        {postsArray.map((item, i) => {
          const {
            group,
            name,
            time,
            title,
            likesCount,
            commentsCount,
            content,
          } = item;

          return (
            <Post
              key={`${item}__${i}`}
              group={group}
              name={name}
              time={time}
              title={title}
              likesCount={likesCount}
              commentsCount={commentsCount}
            >
              {content}
            </Post>
          );
        })}
      </div>
    </Content>
  );
};

export default Category;
